#include "pch.h"
#include "NativeUtil.h"


const double PI = 3.141592653589793238463;

Noclip::Noclip()
{
	enabled = false;
	speed = 1.0;
}

Vector3 GetCamDirection()
{
	uint32_t localPed = PLAYER::GET_PLAYER_PED(0);

	float pedHeading = ENTITY::GET_ENTITY_HEADING(localPed);
	float camHeading = CAM::GET_GAMEPLAY_CAM_RELATIVE_HEADING();
	float camPitch = CAM::GET_GAMEPLAY_CAM_RELATIVE_PITCH();

	float heading = (camHeading + pedHeading);

	float x = -sin(heading * PI / 180.f);
	float y = cos(heading * PI / 180.f);
	float z = sin(camPitch * PI / 180.f);

	float length = sqrt(x * x + y * y + z * z);
	if (length != 0)
	{
		x /= length;
		y /= length;
		z /= length;
	}

	return { x, y, z };
}

void Noclip::Tick()
{



	if (!enabled)
	{
		return;
	}

	uint32_t localPed = PLAYER::GET_PLAYER_PED(0);

	int VehicleHandle = getVehiclePedIsOn(localPed);//GET_VEHICLE_PED_IS_USING( myPed);
	if (VehicleHandle != -1)
		localPed = VehicleHandle;

	Vector3 curPosition = ENTITY::GET_ENTITY_COORDS(localPed, false, false);
	Vector3 camDirection = GetCamDirection();

	ENTITY::SET_ENTITY_VELOCITY(localPed, 0.f, 0.f, 0.f); 

	if (Wpressed/*CONTROLS::IS_CONTROL_PRESSED(0, GAMEPLAY::GET_HASH_KEY("input_move_up_only"))*/)
	{
		curPosition.x += speed * camDirection.x * (highSpeed ? 5 : 1);
		curPosition.y += speed * camDirection.y * (highSpeed ? 5 : 1);
		curPosition.z += speed * camDirection.z * (highSpeed ? 5 : 1);
	}

	if (Spressed/*CONTROLS::IS_CONTROL_PRESSED(0, GAMEPLAY::GET_HASH_KEY("input_move_down_only"))*/)
	{
		curPosition.x -= speed * camDirection.x * (highSpeed ? 5 : 1);
		curPosition.y -= speed * camDirection.y * (highSpeed ? 5 : 1);
		curPosition.z -= speed * camDirection.z * (highSpeed ? 5 : 1);
	}

	ENTITY::SET_ENTITY_COORDS_NO_OFFSET(localPed, curPosition.x, curPosition.y, curPosition.z, true, true, true);
}

void Noclip::Toggle()
{
	auto flag = !enabled;

	uint32_t localPed = PLAYER::GET_PLAYER_PED(0);


	enabled = flag;
}

void Noclip::SetHighSpeed(bool enable)
{
	highSpeed = enable;
}




//We will imagine that our screen is 1920x1080. Default FullHD
void DrawGameRect(float x, float y, float width, float height, uint8_t r, uint8_t g, uint8_t b, uint8_t a)
{
	//float fWidth = width / (float)1920;
	//float fHeight = height / (float)1080;
	//float fX = (x + width / 2) / (float)1920;
	//float fY = (y + height / 2) / (float)1080;

	GRAPHICS::DRAW_RECT(x, y, width, height, r, g, b, a, true, true/*confused screaming*/);
}

int* getTextJustification() {//0 = left, 1 = center, 2 = right
	static int* val = 0;
	if (val == 0) {
		constexpr CMemory::Pattern pattern("48 8B 41 10 33 D2 0F B6 0D");
		val = pattern.Search().GetOffset(9).Get<int*>();//from native SET_TEXT_CENTRE
	}
	return val;
}
float* getTextWrapMin() {
	return (float*)((uint64_t)getTextJustification() - 0x10);//0x10     0x64
}
float* getTextWrapMax() {
	return (float*)((uint64_t)getTextJustification() - 0xC);//0xC     0x60
}

struct rgba { char r, g, b, a; };
struct TextStyle
{
	rgba Color; // 0x00
	float FontScale; // 0x04
	float FontSize; // 0x08
	float TextWrapStart; // 0x0C
	float TextWrapEnd; // 0x10
	uint32_t Font; // 0x14
	uint32_t unk; // 0x18 Something related to widescreens
	uint16_t Align; // 0x1C
	bool DropShadow; // 0x20
	bool TextOutline; // 0x24
	char pad[0x3]; // 0x25
	bool unk2; // 0x28 Something related to widescreens
};
TextStyle* getTextProperties() {
	return (TextStyle*)((uint64_t)getTextJustification() - 0x1C);
}

int textFont = 2;//2 is also ver readable
void DrawGameText(float x, float y, char* text, uint8_t r, uint8_t g, uint8_t b, uint8_t a, float scaleX, float scaleY, int justification, int font)
{
	//float fX = x / (float)1920;
	//float fY = y / (float)1080;
	UI::SET_TEXT_SCALE(scaleX, scaleY);//0.342f
	UI::SET_TEXT_COLOR_RGBA(r, g, b, a);
	//UI::SET_TEXT_CENTRE( center);
	*getTextJustification() = justification;
	if (justification == JUSTIFICATION_RIGHT) {
		//UI::SET_TEXT_WRAP(0.0f, x);
		//*getTextWrapMin() = 0.0f;
		//*getTextWrapMax() = x;
		getTextProperties()->TextWrapStart = 0.0f;
		getTextProperties()->TextWrapEnd = x;
	}
	else {
		//*getTextWrapMin() = 0.0f;
		//*getTextWrapMax() = 1.0f;
		getTextProperties()->TextWrapStart = 0.0f;
		getTextProperties()->TextWrapEnd = 1.0f;
	}
